In [1]:
import MySQLdb

In [6]:
db = MySQLdb.connect(
    host="public id",
    user="id",
    passwd="pw",
    db="sakila",
    charset="utf8")

db

In [7]:
Query = """
    Show Tables;
"""

In [8]:
curs = db.cursor()
curs.execute(Query)

23

### 1) 가장 돈을 많이 지불한 상위 5명의 고객의 이름과 지불 금액 출력

In [9]:
Query = """
    SELECT customer.customer_id, concat(customer.first_name, " ", customer.last_name) AS full_name, sum(payment.amount) AS amount
    FROM customer
    JOIN payment
    ON customer.customer_id = payment.customer_id
    GROUP BY customer.customer_id
    ORDER BY amount DESC
    LIMIT 5


"""

In [10]:
df = pd.read_sql(Query, db)
df

   customer_id       full_name  amount
0          526       KARL SEAL  221.55
1          148    ELEANOR HUNT  216.54
2          144      CLARA SHAW  195.58
3          178   MARION SNYDER  194.61
4          137  RHONDA KENNEDY  194.61

### 2) 배우별 영화 출연 횟수 출력(상위 10개)

In [11]:
Query = """
    SELECT actor.actor_id, concat(actor.first_name, " ", actor.last_name) AS full_name,
    COUNT(film_actor.film_id) AS count
    FROM actor
    JOIN film_actor
    ON actor.actor_id = film_actor.actor_id
    GROUP BY actor.actor_id
    ORDER BY COUNT DESC
    LIMIT 10


"""

In [12]:
df = pd.read_sql(Query, db)
df

   actor_id           full_name  count
0       107      GINA DEGENERES     42
1       102         WALTER TORN     41
2       198         MARY KEITEL     40
3       181      MATTHEW CARREY     39
4        23       SANDRA KILMER     37
5        81      SCARLETT DAMON     36
6       106       GROUCHO DUNST     35
7       144  ANGELA WITHERSPOON     35
8       158     VIVIEN BASINGER     35
9        60         HENRY BERRY     35

### 3) 영화 카테고리별 수입 데이터를 내림차순으로 정렬

In [19]:
Query = """
    SELECT category.name, sum(payment.amount) AS amount
    FROM  payment, rental, inventory, film_category, category
    WHERE category.category_id = film_category.category_id
    AND film_category.film_id = inventory.film_id
    AND inventory.inventory_id = rental.inventory_id
    AND rental.rental_id = payment.rental_id
    GROUP BY category.name
    ORDER BY amount desc

"""

In [20]:
df = pd.read_sql(Query, db)
df

           name   amount
0        Sports  5314.21
1        Sci-Fi  4756.98
2     Animation  4656.30
3         Drama  4587.39
4        Comedy  4383.58
5        Action  4375.85
6           New  4351.62
7         Games  4281.33
8       Foreign  4270.67
9        Family  4226.07
10  Documentary  4217.52
11       Horror  3722.54
12     Children  3655.55
13     Classics  3639.59
14       Travel  3549.64
15        Music  3417.72